package koreait.day17;

public class sudokuTest {
	
	public static void main(String[] args) {
		
		
		Object[][] adw = new Object[9][9];
		sudokuTest adw[][] = new 
		
		
		
		
		System.out.println("::::::::::::::::::::::::::::::::::::");
		System.out.println("::::::::::::營塹朝 蝶紫瓔 虜菟晦 :::::::::");
		System.out.println("::::::::::::::::::::::::::::::::::::");
		System.out.println("旨收收收收收收收收收收收有收收收收收收收收收收收有收收收收收收收收收收收旬\n" +
		"早 " + adw[0][0] + " 弛 " + adw[0][1] + " 弛 " + adw[0][2] + " 早 " +
		adw[0][3] + " 弛 " + adw[0][4] + " 弛 " + adw[0][5] + " 早 " + 
		adw[0][6] + " 弛 " + adw[0][7] + " 弛 " + adw[0][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[1][0] + " 弛 " + adw[1][1] + " 弛 " + adw[1][2] + " 早 " +
		adw[1][3] + " 弛 " + adw[1][4] + " 弛 " + adw[1][5] + " 早 " + 
		adw[1][6] + " 弛 " + adw[1][7] + " 弛 " + adw[1][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[2][0] + " 弛 " + adw[2][1] + " 弛 " + adw[2][2] + " 早 " +
				adw[2][3] + " 弛 " + adw[2][4] + " 弛 " + adw[2][5] + " 早 " + adw[2][6] + " 弛 " + adw[2][7] + " 弛 " + adw[2][8] + " 早\n" +
		"曳收收收收收收收收收收收朱收收收收收收收收收收收朱收收收收收收收收收收收朽\n" +
		"早 " + adw[3][0] + " 弛 " + adw[3][1] + " 弛 " + adw[3][2] + " 早 " +
		adw[3][3] + " 弛 " + adw[3][4] + " 弛 " + adw[3][5] + " 早 " + adw[3][6] + " 弛 " + adw[3][7] + " 弛 " + adw[3][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[4][0] + " 弛 " + adw[4][1] + " 弛 " + adw[4][2] + " 早 " +
		adw[4][3] + " 弛 " + adw[4][4] + " 弛 " + adw[4][5] + " 早 " + adw[4][6] + " 弛 " + adw[4][7] + " 弛 " + adw[4][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[5][0] + " 弛 " + adw[5][1] + " 弛 " + adw[5][2] + " 早 " +
		adw[5][3] + " 弛 " + adw[5][4] + " 弛 " + adw[5][5] + " 早 " + adw[5][6] + " 弛 " + adw[5][7] + " 弛 " + adw[5][8] + " 早\n" +
		"曳收收收收收收收收收收收朱收收收收收收收收收收收朱收收收收收收收收收收收朽\n" +
		"早 " + adw[6][0] + " 弛 " + adw[6][1] + " 弛 " + adw[6][2] + " 早 " +
		adw[6][3] + " 弛 " + adw[6][4] + " 弛 " + adw[6][5] + " 早 " + adw[6][6] + " 弛 " + adw[6][7] + " 弛 " + adw[6][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[7][0] + " 弛 " + adw[7][1] + " 弛 " + adw[7][2] + " 早 " +
		adw[7][3] + " 弛 " + adw[7][4] + " 弛 " + adw[7][5] + " 早 " + adw[7][6] + " 弛 " + adw[7][7] + " 弛 " + adw[7][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[8][0] + " 弛 " + adw[8][1] + " 弛 " + adw[8][2] + " 早 " +
		adw[8][3] + " 弛 " + adw[8][4] + " 弛 " + adw[8][5] + " 早 " + adw[8][6] + " 弛 " + adw[8][7] + " 弛 " + adw[8][8] + " 早\n" +
		"曲收收收收收收收收收收收朴收收收收收收收收收收收朴收收收收收收收收收收收旭");
	}
	
	public void shuffle() {
		
		for (int z = 0; z < 3; z++) {
			for (int zz = 0; zz < 3; zz++) {
				adw[z][zz] = 0; 
			}
		}
		
	}

}
