package funy;

import java.util.Random;

public class sudokui {

	public static void main(String[] args) {
		
		
		Object[][] adw = new Object[9][9];
		Random rd = new Random();
		
		int a = 0;
		int b = 0;
		int c = 0;
		
		int cnt = 0;
		
		a = rd.nextInt(9);
		b = rd.nextInt(9);
		c = rd.nextInt(9)+1;
		boolean start = true;
		
		for (int mmv = 0; mmv < 9; mmv++) {
			for (int mmv2 = 0; mmv2 < 9; mmv2++) { 
				if(adw[mmv][mmv2] == null) { 
					adw[mmv][mmv2] = " ";
					
				}
			}
		}
		
		while(start) {
			a = rd.nextInt(9);
			b = rd.nextInt(9);
			c = rd.nextInt(9)+1;
			adw[a][b] = c;     // 1
			Object dd = adw[a][b];
			adw[a][b] = " ";
			for (int g = 0; g < 9; g++) {
											// 0
				if(adw[a][g] == dd) { // 蕨) 3 0 ( " " ) dd 朝 3
					c = rd.nextInt(9)+1;
					dd = c;
					
				}
				
				
				
					
			}
				
				
			for (int mmv = 0; mmv < 9; mmv++) {
				for (int mmv2 = 0; mmv2 < 9; mmv2++) {
					if(adw[mmv][mmv2] == " ") {
						cnt += 1;
					}
					if(cnt == 0) { 
						start = false;
						
					}
					cnt = 0;
				}
			}
			
			
			
		
		}
		
		
		
		
		
		
		
		
		
		System.out.println("::::::::::::::::::::::::::::::::::::");
		System.out.println("::::::::::::營塹朝 蝶紫瓔 虜菟晦 :::::::::");
		System.out.println("::::::::::::::::::::::::::::::::::::");
		System.out.println("旨收收收收收收收收收收收有收收收收收收收收收收收有收收收收收收收收收收收旬\n" +
		"早 " + adw[0][0] + " 弛 " + adw[0][1] + " 弛 " + adw[0][2] + " 早 " +
		adw[0][3] + " 弛 " + adw[0][4] + " 弛 " + adw[0][5] + " 早 " + 
		adw[0][6] + " 弛 " + adw[0][7] + " 弛 " + adw[0][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[1][0] + " 弛 " + adw[1][1] + " 弛 " + adw[1][2] + " 早 " +
		adw[1][3] + " 弛 " + adw[1][4] + " 弛 " + adw[1][5] + " 早 " + 
		adw[1][6] + " 弛 " + adw[1][7] + " 弛 " + adw[1][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[2][0] + " 弛 " + adw[2][1] + " 弛 " + adw[2][2] + " 早 " +
				adw[2][3] + " 弛 " + adw[2][4] + " 弛 " + adw[2][5] + " 早 " + adw[2][6] + " 弛 " + adw[2][7] + " 弛 " + adw[2][8] + " 早\n" +
		"曳收收收收收收收收收收收朱收收收收收收收收收收收朱收收收收收收收收收收收朽\n" +
		"早 " + adw[3][0] + " 弛 " + adw[3][1] + " 弛 " + adw[3][2] + " 早 " +
		adw[3][3] + " 弛 " + adw[3][4] + " 弛 " + adw[3][5] + " 早 " + adw[3][6] + " 弛 " + adw[3][7] + " 弛 " + adw[3][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[4][0] + " 弛 " + adw[4][1] + " 弛 " + adw[4][2] + " 早 " +
		adw[4][3] + " 弛 " + adw[4][4] + " 弛 " + adw[4][5] + " 早 " + adw[4][6] + " 弛 " + adw[4][7] + " 弛 " + adw[4][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[5][0] + " 弛 " + adw[5][1] + " 弛 " + adw[5][2] + " 早 " +
		adw[5][3] + " 弛 " + adw[5][4] + " 弛 " + adw[5][5] + " 早 " + adw[5][6] + " 弛 " + adw[5][7] + " 弛 " + adw[5][8] + " 早\n" +
		"曳收收收收收收收收收收收朱收收收收收收收收收收收朱收收收收收收收收收收收朽\n" +
		"早 " + adw[6][0] + " 弛 " + adw[6][1] + " 弛 " + adw[6][2] + " 早 " +
		adw[6][3] + " 弛 " + adw[6][4] + " 弛 " + adw[6][5] + " 早 " + adw[6][6] + " 弛 " + adw[6][7] + " 弛 " + adw[6][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[7][0] + " 弛 " + adw[7][1] + " 弛 " + adw[7][2] + " 早 " +
		adw[7][3] + " 弛 " + adw[7][4] + " 弛 " + adw[7][5] + " 早 " + adw[7][6] + " 弛 " + adw[7][7] + " 弛 " + adw[7][8] + " 早\n" +
		"曳式式式式式式式式式式式朱式式式式式式式式式式式朱式式式式式式式式式式式朽\n" +
		"早 " + adw[8][0] + " 弛 " + adw[8][1] + " 弛 " + adw[8][2] + " 早 " +
		adw[8][3] + " 弛 " + adw[8][4] + " 弛 " + adw[8][5] + " 早 " + adw[8][6] + " 弛 " + adw[8][7] + " 弛 " + adw[8][8] + " 早\n" +
		"曲收收收收收收收收收收收朴收收收收收收收收收收收朴收收收收收收收收收收收旭");
	}

}
